[
{"author": ["Victoria"], "rating": ["5.0 out of 5 stars"], "review_date": ["May 22, 2018"], "review_title": ["New blanket received, love the product."], "review": ["The company contacted me about my previous review to ensure I received a free blanket with their new and improved design. It comes with a fuzzy duvet cover as well as a duvet cover to keep you cool. I appreciate the weight of the blanket and bring it with me anytime I travel if I am driving. I would recommend this brand if you are looking for a quality but an affordable weighted blanket. It helps me sleep I would not go back to sleeping without one!"], "support_number": "353 people found this helpful"},
{"author": ["Ryan J. Carter"], "rating": ["5.0 out of 5 stars"], "review_date": ["February 13, 2018"], "review_title": ["Addictive"], "review": ["BUYER BEWARE: This blanket will bend you to its will. You will try to get out of bed, and it push back as if to say,'No, just stay.' You will begin to think about the blanket more and more until you find yourself thinking only about the blanket. When you are away from the blanket you will think only of getting back to the blanket. When you are under the blanket you will think only of how you long to never leave the blanket. So beware the seductive lure of the blanket."], "support_number": "1,351 people found this helpful"},
{"author": ["Kprice"], "rating": ["5.0 out of 5 stars"], "review_date": ["March 27, 2018"], "review_title": ["Even wonderful for us post-menopausal ladies!! A sleep game-changer!!"], "review": ["Ok, I'm a 52 year old woman, just through menopause. I was always an awesome sleeper until menopause...then the night sweats started waking me up between 1 am and 3 am. Grrrr. Hormone therapy helped, but even when the night sweats subsided, I was left with a gaping hole in the middle of my sleep cycle. I eliminated all bedside lights, clocks and tried not to have any electronics in the bedroom (but I can't very well tell my dear husband he can't read his Kindle in bed, he at least keeps it very dim).  We added a white noise machine which really cut down on the cat's night activities bothering us.  But still I was not sleeping like had most of my life.  I'd read about gravity blankets and wondered if my anxieties from work were part of what was going on. I resisted ordering one because it seemed kinda hokey and a rather expensive experiment.  Then I went on a business trip and the hotel where I stayed had a feather light comforter and I couldn't sleep until I took every towel from the bathroom and covered the bed to give the sleeping linens some weight. I slept much better after that. So I came home and ordered this blanket. Wow, what an amazing difference. Someone wrote that the blanket was addicting and I can attest!  I'm loathe to leave in the morning and I'm going to be earlier to be with it. One note about getting hot: Yes, I still wake mid sleep and I'm usually hot. I climb out from under it and make a trip to the bathroom. I go right back to bed, snuggle in, and I'm right back to sleep. I did NOT get one of those furry covers, those things are made of \"microfiber\" which is code for plastic, and I knew it would be super hot. I simply put my gravity blanket over my cotton sheet and cotton quilt, and I'm comfy all night.  I love this thing, I can't believe what a difference it's made in my quality of sleep and that I'm staying asleep later in my cycle and I'm dreaming more. All good."], "support_number": "396 people found this helpful"},
{"author": ["Ashcroft"], "rating": ["5.0 out of 5 stars"], "review_date": ["April 24, 2018"], "review_title": ["Provided anxiety/panic sufferer with best night's sleep in ages—plus note about body weight and blanket buying"], "review": ["My spouse has anxiety/panic, particularly when trying to go to sleep—they often wake up unable to breath or with nightmares, kicking and thrashing. Sometimes, they force themselves to stay up until 2 in the morning just so they are so exhausted that they can't help but remain asleep for a few precious hours (you can imagine that getting up for work is not fun). It was getting worse, and they started to need to fall back again on taking heavy-duty anxiety medications just to manage the nights. A weighted blanket was a shot-in-the-dark effort to try and find some peace. We were even a little worried, as one of the chief complaints my spouse had before now is feeling \"extra weight on their chest\" in the middle of panic, one of the triggers. But, we've had this blanket now for one night—at first, my spouse wasn't really feeling anything but \"a little bit comfy, I guess.\" No complaints of weight. Then, they went to sleep, and it was best night's sleep they've had in ages, all without a single pill. It was so peaceful and quiet. They woke up refreshed and happy. I can't thank the blanket makers enough. I even laid under it for a few minutes—I have many signs of unmedicated ADHD, for context, but it was as if the world became quieter and simpler. I almost fell asleep within minutes, and it was mid-day (I am chronically incapable of taking daytime naps.) If you are on the fence, and suffer from any sort of issue with sleeping or calming down, this is my full endorsement. Seeing my spouse cheerfully awake and smiling in the morning is a huge gift.", "Oh! One more helpful note that took some research on my part before. Get the blanket that is 10% of a person's \"ideal\" body weight. A lot of us are \"overweight\", of course, and many makers have scales that don't take the upper end of that spectrum into account. So, if your \"ideal\" weight is roughly 200lbs, even if you are 350lb, for example, get the 20lb blanket meant for a 200lb individual (most manufacturers don't even make a 30lb or 40lb one.) It should work just fine—extra fat doesn't really \"get in the way\" of the helpful effects, from what I've been reading. And if you end up losing a few pounds later thanks to all of the awesome sleep you'll be getting, your blanket will still match your body type, so you won't need to buy another."], "support_number": "218 people found this helpful"},
{"author": ["Julie Key"], "rating": ["5.0 out of 5 stars"], "review_date": ["September 14, 2018"], "review_title": ["Skeptic to Lover"], "review": ["I saw this on Pinterest, shopped it on Amazon, I NEVER review things even when they are satisfactory but this is something different.", "I slept with it last night for the first time.  It arrived while I was at work, when I got home I unwrapped it and my daughter and I gave it a quick test out before heading out for games.  Honestly I wasn't that impressed.  It's plain grey and depressing looking.  Not much to look at.  I was pretty sure it was just a gimmicky thing I'd probably use a few times but sooner than later find folded in my linen closet never to be used again.  My normal nights go like this:  I take a Xanax and usually a Motrin or Tylenol before bedtime depending on that day's ache or pain, during the night I will rotate between sleeping on each side and my back several times, I have to have one foot out from under the blanket, I get up to use the restroom at least twice and when my alarm goes off, I snooze for the nine minutes it takes to go off again, then most mornings snooze a second time.  I am consistently 30 minutes behind schedule sluggish and irritable.  I lay in bed on my weekends trying to catch up but never feel caught up.  I run myself ragged, I feel ragged.  I'm irritable and exhausted and I float through my days scatterbrained, I have trouble making decisions, paying attention.  I didn't really attribute this to a lack of sleep.  Until this morning.  It's four hours since I woke up today and I'm breathing so deeply and I'm a kind relaxed I don't think I've ever been.  Things are so clear.  I've already balanced my bank account, dealt with two accounts at work and reviewed this item among other things.  My alarm went off and I wasn't agitated, I just took a minute to acclimate, got up and went about my day.  No snooze.  No grumpiness.  Last night I laid the blanket out, did my normal routine, got under the blankets and before I could find the energy to turn on the tv, it had bent me to it's will and I was out remote still clutched in my hand.  I remember trying to fight it to will my hand out from under it and turn the tv on but I could feel it urging me otherwise.  No getting up to pee, no tossing, no turning.  I fell asleep and woke up in the exact same position blankets exactly as the were the night before instead of the chaotic jumble they normally are.  I don't know if there's anything anyone can say that will convince you to buy this, no one should have to be convinced to buy it and actually give it a chance, it should just be the blanket everyone uses because it makes your life better.  I'm a non reviewer, a single mom taking a break from working to tell you that it was the most amazing sleep I've had since I can't remember when.  It gave me peace."], "support_number": "104 people found this helpful"},
{"author": ["Amazon Customer"], "rating": ["5.0 out of 5 stars"], "review_date": ["February 1, 2018"], "review_title": ["Works for anxious people!"], "review": ["Just had the best nights sleep with this blanket.  I didn't toss and turn and I fell asleep and into a deep sleep.  I woke and felt like I actually slept instead of napped.  I didn't keep waking up multiple times with a feeling of panic."], "support_number": "135 people found this helpful"},
{"author": ["Kyle"], "rating": ["5.0 out of 5 stars"], "review_date": ["August 27, 2018"], "review_title": ["I didn't know I needed a weighted blanket (25lb blanket)"], "review": ["First, I am a six foot tall male weighing 240 lbs. I ordered the heaviest blanket this company offered, and boy does it feel great. I live in Southern California and I get extremely hot when I sleep. I usually keep my ambient temperature around 66 degrees at night.", "The queen size 25 lb blanket is amazing and is comfortable for my height. Now, let me get this out of the way; I don't have anxiety, nor am I very stressed or suffer insomnia. I simply wanted the weighted blanket because I liked the idea of something being heavy on my chest as I slept. So, if you are wondering if this review will relate with your needs for this blanket, I only have my own perspective.", "For those of you worried if this blanket may be too hot or cool for you, as an extremely hot sleeper myself, this blanket keeps me at a nearly perfect temperature all night. With my fan on, I sometimes have to throw my sheet on top for a little extra heat retention. If you are a cold sleeper, I would recommend getting the quilt that can wrap over this or be prepared to have a second blanket to go along with it.", "One thing I have noticed is I'm not entirely sure if two people will fit under the one queen sized blanket properly for the weight to cover most of a person's body. I feel like the blanket is just big enough for me for now I like to have it wrapped around most of my body's surface area.", "I have had this blanket for about a month now, and I haven't had any issue with the beads leaking out."], "support_number": "55 people found this helpful"},
{"author": ["Tatiana Chappell"], "rating": ["5.0 out of 5 stars"], "review_date": ["July 27, 2018"], "review_title": ["Good product for good price"], "review": ["I’ve bought it to my husband for better sleep and it’s works perfect! My choice was twin size blanket because I don’t like to have more weight on me and for one person such size is more than enough. It’s nice heavy, good quality blanket for such good price. Not smell, not noisy from beeds moving. Can be hot under for summer but not bad , very nice if turn on a/c. I tried to sleep under it too and surprisingly it was amazing good deep sleep)"], "support_number": null},
{"author": ["Abigail Crosby"], "rating": ["5.0 out of 5 stars"], "review_date": ["January 27, 2018"], "review_title": ["Quality and inexpensive!"], "review": ["This is an amazing weighted blanket. It's the lease expensive 20lb one I've found, and it's really good quality, as far as I can see. The duvet cover is a little expensive, but it's worth it, and it fits the blanket well with several ties to keep it in place. It helps me sleep and concentrate."], "support_number": "57 people found this helpful"},
{"author": ["Bretton "], "rating": ["5.0 out of 5 stars"], "review_date": ["July 13, 2018"], "review_title": ["Can’t Live Without This Now"], "review": ["I looked at a lot of these blankets on amazon and originally had picked a more expensive one. They usually say what you get it what you pay for, but this is not the case on this product. The low cost may scare you away, but the value matches some of the more expensive ones. I pulled it out today and used it and immediately felt relaxed and fell asleep. If you have trouble sleeping like me or RLS, this blanket will help you. Comfortable, breathable and good value for the cost"], "support_number": "23 people found this helpful"}
]